app/controllers/recipes_controller.rb

SELECT * FROM "recipes" WHERE ("recipes"."id" = 3)
UPDATE "recipes" SET "updated_at" = '2011-12-15 14:33:55', "title" = 'Sausage Butty and Tomato Sauce', "method" = 'Toast Bread, Grill Sausage. Add Sauce' WHERE "id" = 3
---
  def update
    @recipe = Recipe.find(params[:id])
    if @recipe.save

INSERT INTO "recipes" ("created_at", "title", "method", "updated_at") VALUES('2011-12-08 15:49:28', '', '', '2011-12-08 15:49:28')
---
  def create
    @recipe = Recipe.create(params[:recipe])

SELECT * FROM "recipes" WHERE ("recipes"."id" = 6)
DELETE FROM "recipes" WHERE ("id" IN (6))
---
  def destroy
    @recipe = Recipe.find(params[:id])
    @recipe.delete